########################################################################################
#########################################   双色球   ####################################
########################################################################################



import random

if __name__ == "__main__":
    try:
        print("===请输入要生成的组数===")
        round = int(input("组数:"))
    except:
        print("请重新输入:")
        round = int(input("组数:"))
        print(f"正在为您随机生成{round}组彩票")
    else:
        print(f"正在为您随机生成{round}组彩票")

def choose(data):                                    #data=5 
    for i in range(len(data) - 1):                   #len(data)=5,range(0,1,2,3,4)
        for j in  range(i+1, len(data)):             #(1)1,2,3,4 (2) 2,3,4 (3) 3,4 (4) 4
            if data[j] < data[i]:                    #当0的位置数据比1大时，进行换位处理，当0的位置比2大时，进行换位，。。。。。
                data[i],data[j] = data[j],data[i]
        print(f"第{i+1}次排序后: ",end = '')
        for j in range(len(data)):
            print(data[j],end=' ')
        print("")

def creatBall():
    i = 0
    blue = random.randint(1,16)             # 在1-16之间随机产生一个数据
    realRed = [0]*6 
    while i < 6:                 #i=1 i=2   # i是依次判断6次是否重复
        red = random.randint(1,33)          # 在1-16之间随机产生一个数据
        j = 0                               # j是实际数据的数组位置，j=0表示依次从0开始排查
        while j < i:                        # 当i=1，j=0时，判断第2次生成的数据是否和第一次相同
            if realRed[j] == red:
                break
            j = j + 1            #j=1 j=2
        if j == i:
            realRed[j] = red                # realRed[7,3,4,5,9,0]
            i = i + 1
    
    print(f"红色球:{realRed},蓝色球:{blue}")
    return realRed

for i in range(round):  #round = 3 i={0,1,2}
    list = [               
        [0] ,   
        [0] ,    
        [0] ,
        [0] ,
        [0]
            ]
    list[i] = creatBall()
    # print(list[i])
    choose(list[i])

















#######################################################################################
######################################   插入排序   ####################################
#######################################################################################




# def choose(data):                                    #data=5 
#     for i in range(len(data) - 1):                   #len(data)=5,range(0,1,2,3,4)
#         for j in  range(i+1, len(data)):             #(1)1,2,3,4 (2) 2,3,4 (3) 3,4 (4) 4
#             if data[j] < data[i]:                    #当0的位置数据比1大时，进行换位处理，当0的位置比2大时，进行换位，。。。。。
#                 data[i],data[j] = data[j],data[i]
#         print(f"第{i+1}次排序后: ",end = '')
#         for j in range(len(data)):
#             print(data[j],end=' ')
#         print("")


# data = [17,121,3,224,57]

# print('\n----我是分界线----')
# print("原列表:",data)
# print('\n----我是分界线----\n')
# choose(data)




















#######################################################################################
######################################   简历说明   ####################################
#######################################################################################




#使用python随机产生不同城市的气象样本，保证每个城市的指标有细微的差异，对生成的样本进行排序并分析。

## 1. 随机样本的产生
## 2. 避免无效的重复数据
## 3. 使数据可以正向排序

## 4. 对异常情况进行处理